app/controllers/api/v1/entries_controller.rb

  def set

    valid_location = valid_location?(params[:address], params[:identifier], params[:city], get_institution_id)
    valid_ssid = valid_ssid?(get_institution_id, params[:ssid])
    has_ssid = has_ssid?(get_institution_id)

    unless has_ssid
      params[:error] = "No SSID"
      # create default ssid
      nssid_id = Orgssid.create_default(institution_id:get_institution_id)
    end

    if valid_ssid
      unless valid_location
        #create location
        nloc_id = Location.create_location(get_institution_id,params[:address], params[:identifier],params[:city])

      else
        #get location_id
        nloc_id = Location.get_location_id(get_institution_id, params[:address], params[:identifier],params[:city])
      end
      #create new entry
      Entry.create_entry(get_institution_id, nloc_id , nssid_id, params[:ap])
---
INSERT INTO "locations" ("institution_id", "address", "city", "identifier", "latitude", "longitude", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "entries" ("institution_id", "location_id", "orgssid_id", "ap_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["institution_id", 1], ["location_id", 1], ["orgssid_id", 1], ["ap_count", 5], ["created_at", "2017-05-13 08:40:34.413187"], ["updated_at", "2017-05-13 08:40:34.413187"]]