app/controllers/api/v1/loc_names_controller.rb

  def get
    loc = Location.where(:institution_id => apikeyToInstitutionId(params[:apikey])).includes(:loc_names).select(:id, :address, :identifier, :city)
---
SELECT "loc_names".* FROM "loc_names" WHERE "loc_names"."location_id" IN (1)
SELECT "locations"."id", "locations"."address", "locations"."identifier", "locations"."city" FROM "locations" WHERE "locations"."institution_id" = ?  [["institution_id", 1]]

  def set
    temp = Location.where(:institution_id => apikeyToInstitutionId(params[:apikey])).find(params[:location_id]).loc_names.where(lang: params[:lang]).first

    temp.name = params[:name]
    temp.save
---
UPDATE "loc_names" SET "name" = ?, "updated_at" = ? WHERE "loc_names"."id" = ?  [["name", "Englishschool"], ["updated_at", "2017-05-13 08:40:34.586291"], ["id", 1]]