app/controllers/api/v1/locations_controller.rb

SELECT "locations"."id", "locations"."address", "locations"."identifier", "locations"."city", "locations"."country" FROM "locations" WHERE "locations"."institution_id" = ?  [["institution_id", 1]]
---
  def get
    render(
        json: Location.where(:institution_id => apikeyToInstitutionId(params[:apikey])).select(:id, :address, :identifier, :city, :country)

    )