app/controllers/api/v1/orginfos_controller.rb

  def get
    render(
        json: Orginfo.where(:institution_id => apikeyToInstitutionId(params[:apikey])).select(:id, :lang, :url).as_json


    )
---
SELECT "orginfos"."id", "orginfos"."lang", "orginfos"."url" FROM "orginfos" WHERE "orginfos"."institution_id" = ?  [["institution_id", 1]]

  def set
    temp = Orginfo.where(:institution_id => get_institution_id, :lang => params[:lang]).first
    temp.url = params[:url].gsub!(/:\//, '://')
    temp.save
---
SELECT  "orginfos".* FROM "orginfos" WHERE "orginfos"."institution_id" = ? AND "orginfos"."lang" = ?  ORDER BY "orginfos"."id" ASC LIMIT 1  [["institution_id", 1], ["lang", "en"]]
UPDATE "orginfos" SET "url" = ?, "updated_at" = ? WHERE "orginfos"."id" = ?  [["url", "http://testworks/english"], ["updated_at", "2017-05-13 08:40:35.533361"], ["id", 1]]