app/controllers/api/v1/orgpolicies_controller.rb

SELECT "orgpolicies"."id", "orgpolicies"."lang", "orgpolicies"."url" FROM "orgpolicies" WHERE "orgpolicies"."institution_id" = ?  [["institution_id", 1]]
---
  def get
    render(
        json: Orgpolicy.where(:institution_id => apikeyToInstitutionId(params[:apikey])).select(:id, :lang, :url).as_json


    )

SELECT  "orgpolicies".* FROM "orgpolicies" WHERE "orgpolicies"."institution_id" = ? AND "orgpolicies"."lang" = ?  ORDER BY "orgpolicies"."id" ASC LIMIT 1  [["institution_id", 1], ["lang", "en"]]
UPDATE "orgpolicies" SET "url" = ?, "updated_at" = ? WHERE "orgpolicies"."id" = ?  [["url", "http://testworks/english"], ["updated_at", "2017-05-13 08:40:35.560598"], ["id", 1]]
---
  def set
    temp = Orgpolicy.where(:institution_id => apikeyToInstitutionId(params[:apikey]), :lang => params[:lang]).first
    temp.url = params[:url].gsub!(/:\//, '://')
    temp.save