app/controllers/api/v1/ssids_controller.rb

  def set
    temp = Orgssid.where(:institution_id => apikeyToInstitutionId(params[:apikey])).find(params[:id])


    if temp.has_attribute? (params[:key])
      # ok.. could not get how to update by param[:key] as column and params[:value] as value so switch case
      case params[:key]
        when 'name'
          temp.name = params[:value]
        when 'port_restrict'
          temp.port_restrict = params[:value]
        when 'transp_proxy'
          temp.transp_proxy = params[:value]
        when 'ipv6'
          temp.ipv6 = params[:value]
        when 'nat'
          temp.nat = params[:value]
        when 'wpa_tkip'
          temp.wpa_tkip = params[:value]
        when 'wpa_aes'
          temp.wpa_aes = params[:value]
        when 'wpa2_tkip'
          temp.wpa2_tkip = params[:value]
        when 'wpa2_aes'
          temp.wpa2_aes = params[:value]
        when 'wired'
          temp.wired = params[:value]
      end
      temp.save
---
SELECT  "orgssids".* FROM "orgssids" WHERE "orgssids"."institution_id" = ? AND "orgssids"."id" = ? LIMIT 1  [["institution_id", 1], ["id", 1]]
UPDATE "orgssids" SET "port_restrict" = ?, "updated_at" = ? WHERE "orgssids"."id" = ?  [["port_restrict", "t"], ["updated_at", "2017-05-13 08:40:36.267977"], ["id", 1]]

  def get
    render(
        json: Orgssid.where(:institution_id => apikeyToInstitutionId(params[:apikey])).select(:id, :name, :port_restrict, :transp_proxy, :ipv6, :nat, :wpa_tkip, :wpa_aes, :wpa2_tkip, :wpa2_aes, :wired).as_json

    )
---
SELECT "orgssids"."id", "orgssids"."name", "orgssids"."port_restrict", "orgssids"."transp_proxy", "orgssids"."ipv6", "orgssids"."nat", "orgssids"."wpa_tkip", "orgssids"."wpa_aes", "orgssids"."wpa2_tkip", "orgssids"."wpa2_aes", "orgssids"."wired" FROM "orgssids" WHERE "orgssids"."institution_id" = ?  [["institution_id", 1]]