app/controllers/exporter_controller.rb

  def institutions
    @institutions = Institution.all
---
SELECT "institutions".* FROM "institutions"