app/controllers/institutions_controller.rb

INSERT INTO "institutions" ("institution_type", "inst_realm", "address", "city", "contact_name", "contact_email", "contact_phone", "created_at", "updated_at", "apikey", "country") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @institution = Institution.new(institution_params)
    puts institution_params

    respond_to do |format|
      if @institution.save

UPDATE "institutions" SET "institution_type" = ?, "updated_at" = ? WHERE "institutions"."id" = ?  [["institution_type", 2], ["updated_at", "2017-03-17 00:09:23.335063"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @institution.update(institution_params)