app/controllers/institutions_controller.rb

SELECT "institutions".* FROM "institutions"
---
  def index
    @institutions = Institution.all

SELECT  "institutions".* FROM "institutions" WHERE "institutions"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @institution = Institution.find(params[:id])

INSERT INTO "institutions" ("country", "institution_type", "inst_realm", "address", "city", "contact_name", "contact_email", "contact_phone", "created_at", "updated_at", "apikey") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @institution = Institution.new(institution_params)
    puts institution_params

    respond_to do |format|
      if @institution.save

DELETE FROM "institutions" WHERE "institutions"."id" = ?  [["id", 1]]
---
  def destroy
    @institution.destroy

SELECT  "institutions".* FROM "institutions" WHERE "institutions"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_institution
    @institution = Institution.find(params[:id])